app/controllers/projects_controller.rb

  def index
    @projects = Project.all

    headers['Access-Control-Allow-Origin'] = '*'
    respond_to do |format|
      format.html { render index: @projects = Project.all  }
      format.json { render json: Project.all , include: ['tasks','users'] }
---
SELECT `projects`.* FROM `projects`
SELECT `projects`.* FROM `projects` INNER JOIN `projects_users` ON `projects`.`id` = `projects_users`.`project_id` WHERE `projects_users`.`user_id` = 86
SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`project_id` = 56
SELECT `users`.* FROM `users` INNER JOIN `projects_users` ON `users`.`id` = `projects_users`.`user_id` WHERE `projects_users`.`project_id` = 76

  def user_projects
    projects = User.find_by(id: params[:user]).projects
---
SELECT `projects`.* FROM `projects` INNER JOIN `projects_users` ON `projects`.`id` = `projects_users`.`project_id` WHERE `projects_users`.`user_id` = 86
SELECT `users`.* FROM `users` WHERE `users`.`id` = 86 LIMIT 1

  def user_project
    project = Project.find_by(id: params[:project_id])
---
SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 76 LIMIT 1

  def user_project_status
    project = Project.find_by(id: params[:project_id]).tasks.where(status: params[:status])
---
SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 96 AND `projects`.`status` = 'In Progress'
SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`project_id` = 96 AND `tasks`.`status` = 'In Progress'

    def set_project
      @project = Project.find(params[:id])
---
SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 96 LIMIT 1