app/controllers/tasks_controller.rb

    task = Task.create(
      name: params[:name],
      due_date: params[:due_date],
      status: params[:status],
      progress: params[:progress],
      category: params[:category],
      description: params[:description],
      project_id: params[:project_id]
    )

    params[:assignees].each do |assignee|
      user = User.find_by(id: assignee)
      task.users << user
    end
    TaskCategory.find_by(id: params[:category]).tasks << task
---
SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 271 LIMIT 1