app/controllers/tasks_controller.rb

INSERT INTO `tasks` (`name`, `due_date`, `status`, `description`, `project_id`, `created_at`, `updated_at`, `progress`, `category`) VALUES ('The Task', '2021-03-24', '', 'The test', 97, '2021-03-24 09:45:54.924027', '2021-03-24 09:45:54.924027', 5, 'Test')
SELECT `users`.* FROM `users` WHERE `users`.`id` = 101 LIMIT 1
---
    task = Task.create(
      name: params[:name],
      due_date: params[:due_date],
      status: params[:status],
      progress: params[:progress],
      category: params[:category],
      description: params[:description],
      project_id: params[:project_id]
    )
    params[:assignees].each do |assignee|
      task.users << User.find_by(id: assignee)

SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`id` = NULL LIMIT 1
DELETE FROM `tasks` WHERE `tasks`.`id` = 421
---
    task = Task.find(params[:task_id])
    task.destroy

SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 277 LIMIT 1
---
    def set_task
      @task = Task.find(params[:id])